# Tap repositories and their packages
tap 'homebrew/dupes'
brew 'apple-gcc42'
brew 'screen'

tap 'rcmdnk/brewall'
brew 'brewall'


# Cask packages

# Other Homebrew packages
brew 'autoconf'
brew 'autoconf213'
brew 'automake'
brew 'boost'
brew 'cabextract'
brew 'ccache'
brew 'cloog'
brew 'cmake'
brew 'cmigemo'
brew 'convmv'
brew 'ctags'
brew 'curl-ca-bundle'
brew 'eigen'
brew 'fontconfig'
brew 'freetype --universal'
brew 'gcc-4.6'
brew 'gdbm'
brew 'geoip'
brew 'gfortran'
brew 'git-flow'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'gradle'
brew 'imagemagick'
brew 'isl'
brew 'jasper --universal'
brew 'jpeg --universal'
brew 'libgpg-error'
brew 'libicns --universal'
brew 'libksba'
brew 'libmpc'
brew 'libpng --universal'
brew 'libtasn1 --universal'
brew 'libtiff --universal'
brew 'libtool'
brew 'libyaml'
brew 'little-cms'
brew 'lua'
brew 'lv'
brew 'lynx'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mobile-shell'
brew 'mosh'
brew 'mpfr'
brew 'mysql'
brew 'nettle'
brew 'nkf'
brew 'node'
brew 'oniguruma'
brew 'openssl'
brew 'p11-kit --universal'
brew 'pkg-config'
brew 'play'
brew 'protobuf'
brew 'python'
brew 'qt'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'sqlite'
brew 'tbb'
brew 'thrift'
brew 'tree'
brew 'vim --with-lua'
brew 'wine'
brew 'winetricks'
brew 'xz'
brew 'yasm'
brew 'z'
